# Updating DataFrames

## Data: Palmer Penguins

In [1]:
#import libraries
import pandas as pd
import numpy as np

import seaborn as sns
import random

In [2]:
#load in the data
penguins = sns.load_dataset('penguins')

In [3]:
#view the data
penguins.head()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,Male
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,Female
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,Female
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,Female

# Manipulating a dataframe

add a new column
```
df['newcolname'] = new_column values
```

New Column Values could be:
 - a `pd.Series` or `numpy.arrray`
 - a single scalar value